{"_id":{"$oid":"5f72af07ce6a1f00221433d0"},"blocks":[{"type":"header","data":{"text":"Intro to Programming - I","level":2}},{"type":"header","data":{"text":"When programming languages meet each other, they all look the same-ish","level":4}},{"type":"paragraph","data":{"text":"<i><b>Note:</b> This is a series of articles explaining how I view and understand the way programming is. This is a project I have been wanting to start, explaining the things I wished I had known before.</i>"}},{"type":"paragraph","data":{"text":"In recent years, the digital world kept becoming larger, popular, and more widely common to the whole world. This caused companies trying to compete in the digital world by competing with products so-called <b>software applications. </b>To produce those software applications, companies request people who could produce those products and we call them <b>developers. </b>Developers are the ones developing those products using technologies such as programming languages.&nbsp;"}},{"type":"header","data":{"text":"What is a Programming language?&nbsp;","level":4}},{"type":"paragraph","data":{"text":"similar to how we want to convey information to other people, we use a common language medium such as English, the machine requires a&nbsp; common medium to understand the information we are conveying and that is what we call a programming language. There are several programming languages for that a machine understands and that is as well similar to how people communicate with different languages. <mark class=\"cdx-marker\">But why would there be different programming languages for computers?</mark>&nbsp;Wouldn't it be better to just use one common programming language so that it would be easier for developers to learn and develop?"}},{"type":"paragraph","data":{"text":"To understand this, whenever you talk with a person who knows multiple languages and that person is trying to explain to you something, does not the person, or maybe even you say that it is difficult to translate/explain a word that is missing in your/their language?&nbsp; Some languages are amazing for spoken poetry but horrible for writing. some languages have some unique traits like french whereby most people say it is a romantic language( I think otherwise, change my mind)."}},{"type":"paragraph","data":{"text":"Like languages, programming languages have their pros and cons; some are great for quick developments for quick bucks but might be difficult to maintain in the long run. And as technologies get better, machines getting faster; there are better ways to communicate with the machines to produce even better software applications."}},{"type":"paragraph","data":{"text":"I<b>f languages will be created like every day, how can we keep up with the world if I want to become a developer now?</b>"}},{"type":"paragraph","data":{"text":"New Programming languages will be invented, improved every time, however, there is always a base, basic rules that a language usually&nbsp;follows, and if we understand those basics, we can convert to a new language rather easy, hence there is no need to be that much worried if you are currently way behind. As long as we understand the basics, we can learn new languages every day!"}},{"type":"paragraph","data":{"text":"This series of chapters dive in those foundations; basic rules that programming languages follow and I hope this will reduce the overwhelming feelings you would have had in learning new languages constantly."}},{"type":"paragraph","data":{"text":"Some quotes :"}},{"type":"quote","data":{"text":"The world won't care about your self-esteem. The world will expect you to accomplish something BEFORE you feel good about yourself","caption":"Bill Gates","alignment":"left"}},{"type":"quote","data":{"text":"A CD. How quaint. We have these in museums.","caption":"Eoin Colfer","alignment":"left"}}],"bookMarks":1,"likes":0,"title":"Intro to Programming - I","subtitle":"When programming languages meet each other, they all look the same-ish","createdAt":{"$date":"2020-09-29T03:50:11.518Z"},"user":{"$oid":"5f71f7ad3cece600224b1198"},"category":{"$oid":"5f72af01ce6a1f00221433cf"},"image":"","__v":0}
{"_id":{"$oid":"5f897f167a9a8f002296301f"},"blocks":[{"type":"header","data":{"text":"Primitive types: part I chapter II","level":2}},{"type":"header","data":{"text":"The basics building blocks of a language to recognize whatever we trying to convey","level":3}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1602844415524.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"In recent years where we started to consume more various information mediums such as the internet, magazines, tv, etc, in the prime days, we used to only get information from basic types such as talking or expressing information through a part of your body(e.g crying or smiling). "}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1602845038539.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"Just like us, machines will understand whatever code you wrote under a set of basic rules, generally speaking: numbers, strings of characters, and booleans."}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1602845068628.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"header","data":{"text":"<i>Numbers</i>","level":4}},{"type":"paragraph","data":{"text":"As the type suggests, numbers take on any numbers that you can think of(numbers with decimals, numbers with many 0's ....you get the gist of it). if you wish to do some math calculations, add say for example write 5 + 5, the machine will understand that you are adding two values together and it will give you a result of as you can guess:&nbsp;<i>11</i> (change my mind)."}},{"type":"header","data":{"text":"<i>Strings</i>","level":4}},{"type":"paragraph","data":{"text":"Strings are like words: letters that are between quotation marks. it can be also numbers but it will not recognize as numbers if you put it between quotation marks."}},{"type":"header","data":{"text":"<i>Boolean</i>","level":4}},{"type":"paragraph","data":{"text":"Boolean is a type that is great for those things that need to be validated.<i>&nbsp;</i>An example of that is those websites that check for if you are already logged in or if you have yet to login to the website: the website checks first if you have logged in before and the result would give the website a boolean value either true or false."}},{"type":"paragraph","data":{"text":"That is the general concepts of those primitive types. there might be more primitive types depending on the programming language you are trying to learn : for example , low level languages such c++, java , c# tend to have different number types such as float numbers(numbers that are only with decimals) as integers(numbers with no decimals), however, you do not need to about them if you understand the general concept of each primitive types."}},{"type":"header","data":{"text":"Are there other types other than the primitive ones?","level":4}},{"type":"paragraph","data":{"text":"Since we mentioned that they are called the basic types, are there more types? yes and those types are actually made by you, but just like macaroni, pizza and spaghetti are made with dough, those types are a combination of primitive types."}}],"bookMarks":0,"likes":0,"title":"Primitive types: part I chapter II","subtitle":"The basics building blocks of a language to recognize whatever we trying to convey","createdAt":{"$date":"2020-10-16T11:07:59.907Z"},"user":{"$oid":"5f71f7ad3cece600224b1198"},"category":{"$oid":"5f72af01ce6a1f00221433cf"},"image":"https://www.lotus-blogs-api.xyz/images/1602844415524.jpg","__v":0}
{"_id":{"$oid":"5f8c14ce527faa0022cf1739"},"blocks":[{"type":"header","data":{"text":"Variables : part II of chapter II","level":2}},{"type":"header","data":{"text":"To remember something, we need to store it somewhere : paper, internet or in your mind(who does that anyways).","level":4}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603015877297.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"Let us assume we are trying solve a math problem whereby we want to get the area of a circle with a radius of 3 . If you check the formula, it is&nbsp;πr2 and we just have to replace the r with 3."}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603013286981.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"the program gave us the result of 28.26. Now, there is a new problem we have to solve : get the volume of a cylinder using the same radius with a height of 4. The formula for that is&nbsp; πr2h."}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603013299996.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"The program gave us 113.04 as our result. A new problem(as you might have guessed) has been given to us and that is to get the volume of the cone( (πr2)h/3)."}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603014418116.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"As you might have noticed, we have been doing some things over and over again(i.e pi or circle area) and I think we could have solved this problem much better if we had stored the recurring values and just use it whenever we need to. Just like a cheat sheet where you write all important formulas in one paper so you do not have to google for a particular formula again and again,we could tell the program to store some recurring values and use it whenever we we need to. This is what we call variables."}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603014906474.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"on the first 3 lines as you notice, we have the values we want to store on the right side of the equal sign and a unique key name for the value on the left side. the unique key name is what we call variables and it just acts as a storage where it stores the values we give on the right side of the equal sign. Now whenever we wish to use those values, we just have to call those variables we named and it will give us the same results."}},{"type":"header","data":{"text":"Variables are named slightly different","level":4}},{"type":"paragraph","data":{"text":"While programming languages have some similar concepts, they have some slightly different ways of doing things such as how they call the variables. It could be categorized into two different groups: high-level programming languages and low level/general programming languages."}},{"type":"paragraph","data":{"text":"<b>High-level programming languages</b>"}},{"type":"paragraph","data":{"text":"High-level languages are those languages that are created with low-level languages in order for us, the developers to learn quickly and produce products for the consumers. those languages abstract some certain aspects of the low-level programming languages (i.e variables, reading values from a text file, etc.). some examples of high-level languages are javascript and python whereby they were both programmed with c++."}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603522877831.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603523002233.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"As you might have noticed, compared to python when we want to create a new variable, we just have to give a unique name, javascript needs something before the name( for instance let, const, or var). there might be some other high-level languages that might call it a different way too and you might ask why are they grouped together if they have this great difference? to answer that we need to check how low-level languages do their calling of variables."}},{"type":"paragraph","data":{"text":"<b>Low-level programming languages</b>"}},{"type":"paragraph","data":{"text":"Low-level programming languages are those that are very close to the hardware of the machine( there are some layers that they have to go through in order for the machine to truly understand the language). so since they are very close to the hardware, it requires more time to learn the language compared to the high-level languages. we will give some examples in c++ and java."}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603523907057.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1603523993539.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"As you might notice, we have wrapped around the variables with something called <b>main. </b>We did this because the program will not run unless we have the values we want to use in the main <b>function(</b>this will explain in a later chapter). and you might as well notice that before calling the variables we are telling something like string, bool. We are telling the language that this variable type is a string or a boolean type(check the first part about primitive types for more information about types)."}},{"type":"paragraph","data":{"text":"We can go back to our previous question of why they are grouped that way. Unlike high-level language whereby you just have to worry about solving a problem, in low-level languages you have to make a certain ritual in order to start worrying about solving a problem"}}],"bookMarks":0,"likes":0,"title":"Variables : part II of chapter II","subtitle":"To remember something, we need to store it somewhere : paper, internet or in your mind(who does that anyways).","createdAt":{"$date":"2020-10-18T10:11:22.595Z"},"user":{"$oid":"5f71f7ad3cece600224b1198"},"category":{"$oid":"5f72af01ce6a1f00221433cf"},"image":"https://www.lotus-blogs-api.xyz/images/1603015877297.jpg","__v":0}
{"_id":{"$oid":"5fdf6ee1db9ad9481a26b1cb"},"blocks":[{"type":"header","data":{"text":"My Journey on my final year Project","level":2}},{"type":"header","data":{"text":"Wishing to conclude my years in the university with a bang.","level":3}},{"type":"image","data":{"file":{"url":"https://www.lotus-blogs-api.xyz/images/1608478384025.jpg"},"caption":"","withBorder":false,"stretched":false,"withBackground":false}},{"type":"paragraph","data":{"text":"This year, I guess this semester will be my last year before taking an internship after concluding with my final year project. I have been worried about it, so I have been pushing myself into many concepts and technologies to deepen my understanding of backend and deployment."}},{"type":"paragraph","data":{"text":"This will be my first post on the journey I am taking until I present the project.&nbsp;"}},{"type":"paragraph","data":{"text":"The project I took is about coaching; students helping each other whether it is about guiding students in their courses or semesters as a whole. The students would book lessons from a coach and would communicate through the application via either chat or video(I have not decided yet). there are more features in the system such as asking questions, handle payment using the Stripe payment system, and maintaining those transactions using blockchain concepts.&nbsp;"}},{"type":"paragraph","data":{"text":"In order to make this project possible, I have to study technologies that would help me automate a lot of things that would make me focus more on logic rather than the tedious repetitive time taking tasks.&nbsp;"}},{"type":"paragraph","data":{"text":"I grouped the technologies into the frontend, backend, and DevOps."}},{"type":"paragraph","data":{"text":"for the frontend, I will be using Reactjs with typescript and TailwindCSS. For the backend, I would be using nestjs, a nodejs typescript framework, GraphQL, MongoDB, and Nginx. for the DevOps, I will be using Travis CI, Docker and bash scripting.&nbsp;"}},{"type":"paragraph","data":{"text":"I will be discussing them a lot in future posts and share what I have learned and the challenges I would face."}}],"bookMarks":0,"likes":0,"title":"My Journey on my final year Project","subtitle":"Wishing to conclude my years in the university with a bang.","createdAt":{"$date":"2020-12-20T15:33:49.607Z"},"user":{"$oid":"5f71f7ad3cece600224b1198"},"category":{"$oid":"5fdf6edddb9ad931ec26b1ca"},"image":"https://www.lotus-blogs-api.xyz/images/1608478384025.jpg","__v":0}
{"_id":{"$oid":"5fe35258db9ad91e6026b1cd"},"blocks":[{"type":"header","data":{"text":"Do not depend on one Server","level":2}},{"type":"header","data":{"text":"Servers should be immutable, just like your variables","level":4}},{"type":"paragraph","data":{"text":"In functional programming, there is a concept where it states that variables should be immutable, and once created, they should not be modified. In order to have the same variable but with some modified value, you have to create a new variable that has the previous values with the modified values you wanted it to have. This concept helps a lot during debugging, reducing common causes made from modified values by the whole system."}},{"type":"paragraph","data":{"text":"Now, what if we think of servers as immutable variables? you do not modify the server once created but replace it with a new one with the existing and additional configuration. This would make things easier because that means that your project does not depend on the server itself but can live in any servers that are created."}},{"type":"paragraph","data":{"text":"My first time deploying a project was 2 years ago and I had this problem with servers where I had to manually configure both the server and the project to adjust to the server on a weekly basis. Now if I move to another server, I have to recall and remember how I configured the project and both the server and do the never-ending cycle again and again. This is not a problem if it is a one team project but what if it is a team?"}},{"type":"paragraph","data":{"text":"Whenever something is up, in order to deploy and build fast, a member has to configure the project or the system manually for every deployment. Now imagine it is only one person who is doing the configuration every time and what would the company do if they lose the person that used to configure the server? no one knows how the server has been configured because there was no changelog and maybe the person had a file that he kept for configuring the server as a reference and it might help in the short term, but will you expect the error to be the same thing always? In coding or in anything, we have to expect the unexpected."}},{"type":"paragraph","data":{"text":"There are ways to mitigate this such as the development environment should be same or similar to the production environment and that can be done by containerizing the project and automating the deployment in such a way that no one will do any configurations within the system but rather within a commit that is being tested and logged."}},{"type":"paragraph","data":{"text":"Credit goes to the amazing people who do a podcast about basically anything related to software engineering, codingblocks.net. They tend to explain many great and thought-provoking topics, books, and such, and without their podcast, I would not have had the opportunity to learn those amazing concepts."}}],"bookMarks":0,"likes":1,"title":"Do not depend on one Server","subtitle":"Servers should be immutable, just like your variables","createdAt":{"$date":"2020-12-23T14:21:05.052Z"},"user":{"$oid":"5f71f7ad3cece600224b1198"},"category":{"$oid":"5fdf6edddb9ad931ec26b1ca"},"image":"","__v":0}
